#### VelocityPressure Property

---

|  |
| --- |
| PipeFittingAndAccessoryPressureDropItem Class   See Also |

The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ftÂ·sÂ²)).

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double VelocityPressure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VelocityPressure As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double VelocityPressure { 	double get (); } ``` |

# See Also

PipeFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Plumbing Namespace